IRP/src/Catalogs/BankTerms/BankTerms.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Catalog>
  <name>BankTerms</name>
  <attributes>
    <name>BankTermType</name>
    <type>
      <types>EnumRef.BankTermTypes</types>
    </type>
  </attributes>
  <tabularSections>
    <name>PaymentTypes</name>
    <attributes>
      <name>PaymentType</name>
      <type>
        <types>CatalogRef.PaymentTypes</types>
      </type>
    </attributes>
    <attributes>
      <name>Percent</name>
      <type>
        <types>DefinedType.typePercent</types>
      </type>
    </attributes>
    <attributes>
      <name>Account</name>
      <type>
        <types>CatalogRef.CashAccounts</types>
      </type>
    </attributes>
    <attributes>
      <name>Partner</name>
      <type>
        <types>CatalogRef.Partners</types>
      </type>
    </attributes>
    <attributes>
      <name>LegalName</name>
      <type>
        <types>CatalogRef.Companies</types>
      </type>
    </attributes>
    <attributes>
      <name>PartnerTerms</name>
      <type>
        <types>CatalogRef.Agreements</types>
      </type>
    </attributes>
    <attributes>
      <name>LegalNameContract</name>
      <type>
        <types>CatalogRef.LegalNameContracts</types>
      </type>
    </attributes>
  </tabularSections>
  <tabularSections>
    <name>AddAttributes</name>
    <attributes>
      <name>Property</name>
      <type>
        <types>ChartOfCharacteristicTypesRef.AddAttributeAndProperty</types>
      </type>
    </attributes>
    <attributes>
      <name>Value</name>
      <type>
        <types>Characteristic.AddAttributeAndProperty</types>
      </type>
    </attributes>
  </tabularSections>
</mdclass:Catalog>

IRP/src/Enums/BankTermTypes/BankTermTypes.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Enum>
 <name>BankTermTypes</name>
 <enumValues>
  <name>PaymentTerminal</name>
 </enumValues>
 <enumValues>
  <name>PaymentAgent</name>
 </enumValues>
</mdclass:Enum>

IRP/src/Catalogs/BankTerms/Forms/ItemForm/Module.bsl
#Region FormEvents

&AtServer
Procedure OnCreateAtServer(Cancel, StandardProcessing)
	LocalizationEvents.CreateMainFormItemDescription(ThisObject, "GroupDescriptions");
	AddAttributesAndPropertiesServer.OnCreateAtServer(ThisObject);
EndProcedure

&AtServer
Procedure BeforeWriteAtServer(Cancel, CurrentObject, WriteParameters)
	AddAttributesAndPropertiesServer.BeforeWriteAtServer(ThisObject, Cancel, CurrentObject, WriteParameters);
EndProcedure

&AtClient
Procedure NotificationProcessing(EventName, Parameter, Source, AddInfo = Undefined) Export
	If EventName = "UpdateAddAttributeAndPropertySets" Then
		AddAttributesCreateFormControl();
	EndIf;
EndProcedure

&AtClient
Procedure OnOpen(Cancel)
	SetVisible();
EndProcedure

#EndRegion

&AtClient
Procedure DescriptionOpening(Item, StandardProcessing) Export
	LocalizationClient.DescriptionOpening(Object, ThisObject, Item, StandardProcessing);
EndProcedure

#Region AddAttributes

&AtClient
Procedure AddAttributeStartChoice(Item, ChoiceData, StandardProcessing) Export
	AddAttributesAndPropertiesClient.AddAttributeStartChoice(ThisObject, Item, StandardProcessing);
EndProcedure

&AtServer
Procedure AddAttributesCreateFormControl()
	AddAttributesAndPropertiesServer.CreateFormControls(ThisObject);
EndProcedure

#EndRegion

#Region Actions

&AtClient
Procedure BankTermTypeOnChange(Item)
	SetVisible();
EndProcedure

&AtClient
Procedure SetVisible()
	If Object.BankTermType = PredefinedValue("Enum.BankTermTypes.PaymentAgent") Then
		SetVisibleByBankTermType(False);
	ElsIf Object.BankTermType = PredefinedValue("Enum.BankTermTypes.PaymentTerminal") Then
		SetVisibleByBankTermType(True);
	EndIf;
EndProcedure

&AtClient
Procedure SetVisibleByBankTermType(isTerminal)
	Items.PaymentTypesAccount.Visible = isTerminal;
	Items.PaymentTypesLegalName.Visible = Not isTerminal;
	Items.PaymentTypesLegalNameContract.Visible = Not isTerminal;
	Items.PaymentTypesPartner.Visible = Not isTerminal;
	Items.PaymentTypesPartnerTerms.Visible = Not isTerminal;
EndProcedure

#EndRegion
